<?php
require_once $_SERVER['DOCUMENT_ROOT'] . '/temp/header.php';
require_once $_SERVER['DOCUMENT_ROOT'] . '/temp/nav_aside.php';
?>

<section>
    <div class="container">
        <div class="title">
            Здесь я хочу поподробнее рассказать о себе для всех желающих знать эту информацию.
        </div>
        <hr>
        <div class="about">
             В мире айти я еще совсем на птичьих правах, все началось достаточно банально: мне стало скучно сидеть без дела дома во время бущующей казни египетской (COVID-19), и я решил, еще тогда не понимая, что во многом определяю свое будущее, попробовать разработать небольшое приложения под android. Получилось все достаточно неплохо, для человека которым этим никогда осознанно не занимался, но к сожалению, выложить на обозрение пользователям по определенным причинам его так и не вышло. После этой "попытки" сходу взять быка за рога мой пыл на некоторое время (чуть больше года) остыл, к тому же на это повлияли многие резкие изменения в моей жизни, как например переезд из родных пенат в прекрасный город - Санкт-Петербург. Но только стоило всему утрястись, как я снова стал охвачен идеей влиться в профессию, но на этот раз я загорелся освоить технологии производства сайтов. Почти полгода я безвылезно изучал основы специализации: HTML, CSS, JS и др. И не поверите, это дало свои результаты! как только я немного окреп, решая испытать судьбу начал поиски работы, не могу сказать что все было гладко и быстро, но тем не менее через определенное время судьба улыбнулась мне! <br>
            Я попал в компанию <a href="https://farexpo.ru/" target="_blank">farexpo.</a>
        </div>
    </div>
</section>


<?php
require_once $_SERVER['DOCUMENT_ROOT'] . '/temp/footer.php';
?>
