<?php
require_once $_SERVER['DOCUMENT_ROOT'] . '/tmp/header.php';
require_once $_SERVER['DOCUMENT_ROOT'] . '/tmp/nav_aside.php';
?>

<section class="about_section">
    <div class="container">
        <div class="title">
            Здесь я хочу поподробнее рассказать о себе для всех желающих знать эту информацию.
        </div>
        <hr>
        <div class="about">
             В мире айти я еще совсем на птичьих правах, все началось достаточно банально: мне стало скучно сидеть без дела дома во время бущующей казни египетской (COVID-19), и я решил, еще тогда не понимая, что во многом определяю свое будущее, попробовать разработать небольшое приложения под android.
            <br><br>Получилось все достаточно неплохо, для человека которым этим никогда осознанно не занимался, но к сожалению, выложить на обозрение пользователям по определенным причинам его так и не вышло.
            <br><br>После этой "попытки" сходу взять быка за рога мой пыл на некоторое время (чуть больше года) иссяк, к тому же на это повлияли многие резкие изменения в моей жизни, как например переезд из родных пенат в прекрасный город - Санкт-Петербург.
            <br><br>Но только стоило всему утрястись, как я снова стал охвачен идеей влиться в профессию, но на этот раз я загорелся освоить технологии производства сайтов. Почти полгода я безвылезно изучал основы специализации: HTML, CSS, JS и др. И не поверите, это дало свои результаты! как только я немного окреп, решив испытать судьбу начал поиски работы, не могу сказать что все было гладко и быстро, но тем не менее через определенное время судьба улыбнулась мне! <br><br>
            Я попал в компанию <a href="https://farexpo.ru/" target="_blank">farexpo.</a>
        </div>
        <div>
            <img src="/src/img/logo/Logo_FE.png" alt="farexpo">
        </div>
        <br>
        <div class="about">
            В которой по сей день добросовестно тружусь. Здесь я познакомился с CRM-система, в частности с 1c bitrix, изучил определенный массив различных технологий, и в принципе набил руку. Но это отнюдь не самое важное, что я узнал...
            <br><br>
            Скажу честно, далеко не сразу ко мне пришло понимание, что без PHP современному вэб-разработчику невозможно обходится. Дело в том, что bitrix, как и многие CRM-системы как раз таки написан на PHP, и конечно же язык используется для поддержки сайтов в рамках системы. Только попав в farexpo я смог плотно поработать с языком.
            <br><br>
            На первых порах PHP я не знал, и не стримился его изучать, по ошибке считая, что пресловутый JS намного важнее, делая упор на него. Но в какой-то момент я полюбил PHP, с течением времени веселый слоник покорил мое сердце своими возможностями и понятным синтаксисом. В данный момент я стараюсь углубится в backend-составляющую именно посредством PHP (спасибо Дмитрию Котерову и Игорю Симдянову за прекрасные учебники по языку).
            <br><br>
            Со временем пришло осознание, что было бы здорово задекларировать мои навыки более формальным образом - получить образование по специальности. Мой выбор пал на Петровский колледж, отделение информационных технологий, где я на данный момент учусь на специальность "Информационные системы и программирование".
            <br><br>
            Даже не смотря на то, что я еще всего лишь на первом курсе, уже можно с уверенностью заявить, что обучение в этом колледже проходит для меня очень продуктивно, здесь я уже успел освоить работу с базами данных, операционными системами linux, архитектуру комп.систем и комп.сети.<br>
            Познакомился и изучил C# и .NET, разные паттерны и алгоритмы программирования. Даже в творческом порыве успел написать игру,телеграмм-бота, а так же небольше декстопное приложение с которым вы можете ознакомится тут: <br><br>
            <a href="https://github.com/JavNikTool/fullRandomEH" target="_blank">https://github.com/JavNikTool/fullRandomEH</a>

        </div>
        <br>
        <div class="about">
            В быту помимо своего любимого дела, я так же большой фанат музыки (особенно тяжелой), когда-то я даже этим занимался, выступал, но это совсем другая история..
            <br><br>
            <img src="/src/img/photo/music.jpg" alt="music">
            <br><br>
            Поэтому буду всегда рад обсудить эту тему, возможно именно вы откроете для меня очередную группу, которая не покинет мой плей-лист в течении долгого времени.
        </div>
    </div>
</section>


<?php
require_once $_SERVER['DOCUMENT_ROOT'] . '/tmp/footer.php';
?>
